// 技能点取决的属性名称
const skillAtt = "int";
// 各项技能点
// 职业本职技能
// 贤者之剑
// charJobSkills = [
//   "特技",
//   "攀爬",
//   "专注",
//   "工艺",
//   "医疗",
//   "隐匿",
//   "威吓",
//   "知识-历史",
//   "知识-自然",
//   "知识-贵族",
//   "察觉",
//   "武术知识",
//   "专业",
//   "骑术",
//   "察言观色",
//   "游泳",
// ];
//军道之剑
// const charJobSkills = [
//   "特技",
//   "攀爬",
//   "专注",
//   "工艺",
//   "交涉",
//   "威吓",
//   "知识-历史",
//   "知识-地方",
//   "武术知识",
//   "游泳",
// ];

const charJobSkills = [
  "特技",
  "唬骗",
  "攀爬",
  "工艺",
  "交涉",
  "飞行",
  "医疗",
  "威吓",
  "知识-奥秘",
  "知识-历史",
  "知识-地方",
  "语言学",
  "察觉",
  "察言观色",
  "法术辨识",
  "隐匿",
  "生存",
  "游泳",
  "使用魔法装置",
];
// [技能名称, 取决属性, 是否受训,加点]
const charSkills = [
  ["攀爬", "力量", 0, 0],
  ["游泳", "力量", 0, 1],
  ["特技", "敏捷", 0, 4],
  ["解除装置", "敏捷", 1, 0],
  ["逃脱", "敏捷", 0, 0],
  ["飞行", "敏捷", 0, 0],
  ["骑术", "敏捷", 0, 0],
  ["巧手", "敏捷", 1, 0],
  ["隐匿", "敏捷", 0, 4],
  ["估价", "智力", 0, 0],
  ["工艺", "智力", 0, 0],
  ["语言学", "智力", 1, 0],
  ["法术辨识", "智力", 1, 0],
  ["知识-奥秘", "智力", 1, 1],
  ["知识-地城", "智力", 1, 0],
  ["知识-工程", "智力", 1, 0],
  ["知识-地理", "智力", 1, 0],
  ["知识-历史", "智力", 1, 0],
  ["知识-地方", "智力", 1, 1],
  ["知识-自然", "智力", 1, 1],
  ["知识-贵族", "智力", 1, 0],
  ["知识-位面", "智力", 1, 0],
  ["知识-宗教", "智力", 1, 0],
  ["医疗", "感知", 0, 0],
  ["察觉", "感知", 0, 4],
  ["专业", "感知", 1, 0],
  ["察言观色", "感知", 0, 4],
  ["生存", "感知", 1, 4],
  ["唬骗", "魅力", 0, 2],
  ["交涉", "魅力", 0, 4],
  ["易容", "魅力", 0, 0],
  ["驯养动物", "魅力", 1, 0],
  ["威吓", "魅力", 0, 4],
  ["表演", "魅力", 0, 0],
  ["使用魔法装置", "魅力", 1, 4],
  ["专注", "体质", 0, 0],
  ["武术知识", "智力", 1, 0],
];

function PlayerSkills() {
  return {
    setSkillNameText(skillInfo) {
      let skillName = skillInfo[0];
      if (charJobSkills.includes(skillInfo[0])) {
        skillName += "*";
      }
      if (skillInfo[2] === 1) {
        skillName = "#" + skillName;
      }
      return skillName;
    },
    setSkillValue(skillInfo) {
      let skillValue = 0;
      if (charJobSkills.includes(skillInfo[0])) {
        skillValue += Number(skillInfo[3] !== 0) * 3;
      }
      skillValue += charAttModifier[Att2Idx[skillInfo[1]]];
      skillValue += skillInfo[3];
      return skillValue;
    },
  };
}
